case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     chtMultiRegionFoam;


regionSolvers
{
    fluid   fluid;
    solid   solid;
}

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         20;

deltaT          1e-3;

writeControl    adjustableRunTime;
writeInterval   0.2;

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       0.01;
