case/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue T 300
);

regions
(
    sphereToCell
    {
        centre (0 0 0);
        radius 0.03;
        fieldValues
        (
            volScalarFieldValue T 360
        );
    }
);
